STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_DirectionFinding_Central_Locator/STM32_WPAN/App/gatt_client_app.c
      /* USER CODE END GATT_CLIENT_APP_Init_3 */
    }

    a_ClientContext[index].svcInfo[SVC_ID_GAP].uuid  = GAP_SERVICE_UUID;
    a_ClientContext[index].svcInfo[SVC_ID_GATT].uuid = GATT_SERVICE_UUID;
    /* USER CODE BEGIN GATT_CLIENT_APP_Init_4 */

    /* USER CODE END GATT_CLIENT_APP_Init_4 */
  }

  /* Register the event handler to the BLE controller */
  SVCCTL_RegisterCltHandler(Event_Handler);

  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_task);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */

  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

    case PEER_CONN_HANDLE_EVT :
    {
      uint8_t index;

      for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
      {
        if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCONNECTED)
        {
          /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_1 */

          /* USER CODE END PEER_CONN_HANDLE_EVT_1 */

          a_ClientContext[index].connHdl = p_Notif->ConnHdl;
          a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
          a_ClientContext[index].att_mtu = BLE_DEFAULT_ATT_MTU;

          /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_2 */

          /* USER CODE END PEER_CONN_HANDLE_EVT_2 */

          break;
        }
      }
      if(index == CFG_BLE_NUM_CLIENT_CONTEXTS)
      {
        LOG_ERROR_APP("Error: reached maximum number of connected servers!\n");
        /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_3 */

        /* USER CODE END PEER_CONN_HANDLE_EVT_3 */
      }
    }
    break;

    case PEER_DISCON_HANDLE_EVT :
    {
      for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
      {
        if(a_ClientContext[index].connHdl == p_Notif->ConnHdl)
        {
          /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT_1 */

          /* USER CODE END PEER_DISCON_HANDLE_EVT_1 */

          a_ClientContext[index].connHdl = 0xFFFF;
          a_ClientContext[index].state = GATT_CLIENT_APP_DISCONNECTED;

          /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT_2 */

          /* USER CODE END PEER_DISCON_HANDLE_EVT_2 */

          break;
        }
      }
    }
    break;

    default:
    /* USER CODE BEGIN ConnOpcode_Default */

    /* USER CODE END ConnOpcode_Default */
    break;
  }
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_2 */

  /* USER CODE END GATT_CLIENT_APP_Notification_2 */
  return;
}

/* Deprecated */
uint8_t GATT_CLIENT_APP_Set_Conn_Handle(uint8_t index, uint16_t connHdl)
{
  uint8_t ret;

  if (index < CFG_BLE_NUM_CLIENT_CONTEXTS)
  {
    a_ClientContext[index].connHdl = connHdl;
    a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
    ret = 0;
  }
  else
  {
    ret = 1;
  }

  return ret;
}

int GATT_CLIENT_APP_Get_Index(uint16_t connHdl)
{
  uint8_t index;

  if(connHdl > 0x0EFF)
  {
    return -1;
  }

  for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if (a_ClientContext[index].connHdl == connHdl)
    {
      return index;
    }
  }

  return -1;
}

uint8_t GATT_CLIENT_APP_Get_State(uint8_t index)
{
  return a_ClientContext[index].state;
}

void GATT_CLIENT_APP_DiscoverServices(uint16_t connection_handle, uint8_t start_task)
{
  for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].connHdl == connection_handle)
    {
      /* USER CODE BEGIN GATT_CLIENT_APP_Discover_services_1 */

      /* USER CODE END GATT_CLIENT_APP_Discover_services_1 */
      if(start_task)
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_SERVICES;

        UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      }
      else
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;

        GATT_CLIENT_APP_DiscoverServicesWithIndex(index);
      }

      /* USER CODE BEGIN GATT_CLIENT_APP_Discover_services_2 */

      /* USER CODE END GATT_CLIENT_APP_Discover_services_2 */

      break;
    }
  }

  return;
}

void GATT_CLIENT_APP_DiscoverServicesWithIndex(uint8_t index)
{
  gatt_procedure(index, PROC_GATT_EXCHANGE_CONFIG);
  gatt_procedure(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
  gatt_procedure(index, PROC_GATT_FIND_INCLUDED_SERVICES);
  gatt_procedure(index, PROC_GATT_DISC_ALL_CHARS);
  gatt_procedure(index, PROC_GATT_DISC_ALL_DESCS);
  gatt_procedure(index, PROC_GATT_PROPERTIES_ENABLE_ALL);
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

 static uint8_t gatt_procedure(uint8_t index, ProcGattId_t GattProcId)
{
  uint16_t svcIdx;
  tBleStatus bleStatus = BLE_STATUS_SUCCESS;
  uint8_t status;

  if (index >= CFG_BLE_NUM_CLIENT_CONTEXTS)
  {
    status = 1;
  }
  else
  {
    status = 0;

    UTIL_SEQ_ClrEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);

    procClientContext.current_gatt_proc = GattProcId;

    switch (GattProcId)
    {
      case PROC_GATT_EXCHANGE_CONFIG:
      {
        procClientContext.gatt_error_code = 0;

        LOG_INFO_APP("GATT exchange configuration\n");
        status = aci_gatt_exchange_config(a_ClientContext[index].connHdl);
        if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("Completed Successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("Failed, status=0x%02X, result=0x%02X\n\n", bleStatus, procClientContext.gatt_error_code);
        }
      }
      break; /* PROC_GATT_EXCHANGE_CONFIG */
      case PROC_GATT_DISC_ALL_PRIMARY_SERVICES:
      {
        procClientContext.gatt_error_code = 0;

        LOG_INFO_APP("GATT services discovery\n");
        bleStatus = aci_gatt_disc_all_primary_services(a_ClientContext[index].connHdl);

        if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES services discovered Successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES aci_gatt_disc_all_primary_services cmd Failed, status=0x%02X, result=0x%02X\n\n", bleStatus, procClientContext.gatt_error_code);
          status++;
        }
      }
      break; /* PROC_GATT_DISC_ALL_PRIMARY_SERVICES */

      case PROC_GATT_FIND_INCLUDED_SERVICES:
      {
        LOG_INFO_APP("GATT Find Included Services\n");
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].charStartHdl != 0x0000
             && a_ClientContext[index].svcInfo[svcIdx].findIncludedServices)
          {
            procClientContext.gatt_error_code = 0;

