STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_DirectionFinding_Central_Locator/STM32_WPAN/App/gatt_client_app.c
            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                         a_ClientContext[index].svcInfo[svcIdx].uuid,
                         a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                         a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            bleStatus = aci_gatt_find_included_services(a_ClientContext[index].connHdl,
                                                        a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                                                        a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Service UUID 0x%04X included service found Successfully\n\n",
                           a_ClientContext[index].svcInfo[svcIdx].uuid);
              a_ClientContext[index].svcInfo[svcIdx].status = SVC_INFO_STATUS_DISCOVERED;
            }
            else
            {
              LOG_ERROR_APP("  Service UUID 0x%04X included service found Failed, status =0x%02X, result=0x%02X\n\n",
                            a_ClientContext[index].svcInfo[svcIdx].uuid, bleStatus, procClientContext.gatt_error_code);
              status++;
            }
            /* USER CODE BEGIN PROC_GATT_FIND_INCLUDED_SERVICES_0 */

            /* USER CODE END PROC_GATT_FIND_INCLUDED_SERVICES_0 */
          }
        }
        /* USER CODE BEGIN PROC_GATT_FIND_INCLUDED_SERVICES */

        /* USER CODE END PROC_GATT_FIND_INCLUDED_SERVICES */
        if (status == 0)
        {
          LOG_INFO_APP("Included service discovery ended successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("Included service discovery failed\n\n");
        }
      }
      break; /* PROC_GATT_FIND_INCLUDED_SERVICES */

      case PROC_GATT_DISC_ALL_CHARS:
      {
        LOG_INFO_APP("DISCOVER_ALL_CHARS on ConnHdl=0x%04X\n",a_ClientContext[index].connHdl);
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].charStartHdl != 0x0000
             && a_ClientContext[index].svcInfo[svcIdx].uuid != 0)
          {
            procClientContext.gatt_error_code = 0;

            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                              a_ClientContext[index].svcInfo[svcIdx].uuid,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);
            bleStatus = aci_gatt_disc_all_char_of_service(
                              a_ClientContext[index].connHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Service UUID 0x%04X characteristics discovered Successfully\n\n",
                           a_ClientContext[index].svcInfo[svcIdx].uuid);
              a_ClientContext[index].svcInfo[svcIdx].status = SVC_INFO_STATUS_DISCOVERED;
            }
            else
            {
              LOG_ERROR_APP("  Service UUID 0x%04X characteristics discovery Failed, status=0x%02X, result=0x%02X\n\n",
                            a_ClientContext[index].svcInfo[svcIdx].uuid, bleStatus, procClientContext.gatt_error_code);
              status++;
            }
            /* USER CODE BEGIN PROC_GATT_DISC_ALL_CHARS_0 */

            /* USER CODE END PROC_GATT_DISC_ALL_CHARS_0 */
          }
        }
        /* USER CODE BEGIN PROC_GATT_DISC_ALL_CHARS */

        /* USER CODE END PROC_GATT_DISC_ALL_CHARS */
        if (status == 0)
        {
          LOG_INFO_APP("All characteristics discovered Successfully \n\n");
        }
        else
        {
          LOG_ERROR_APP("All characteristics discovery Failed \n\n");
        }
      }
      break; /* PROC_GATT_DISC_ALL_CHARS */

      case PROC_GATT_DISC_ALL_DESCS:
      {
        LOG_INFO_APP("DISCOVER_ALL_CHAR_DESCS on ConnHdl=0x%04X\n",
                              a_ClientContext[index].connHdl);
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].charStartHdl != 0x0000
             && a_ClientContext[index].svcInfo[svcIdx].uuid != 0)
          {
            procClientContext.gatt_error_code = 0;

            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                              a_ClientContext[index].svcInfo[svcIdx].uuid,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);
            bleStatus = aci_gatt_disc_all_char_desc(
                              a_ClientContext[index].connHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Descriptors discovered Successfully\n\n");
              a_ClientContext[index].svcInfo[svcIdx].status = SVC_INFO_STATUS_DISCOVERED;
            }
            else
            {
              LOG_ERROR_APP("  Descriptors discovery Failed, status=0x%02X, result=0x%02X\n\n", bleStatus, procClientContext.gatt_error_code);
              status++;
            }
            /* USER CODE BEGIN PROC_GATT_DISC_ALL_DESCS_0 */

            /* USER CODE END PROC_GATT_DISC_ALL_DESCS_0 */
          }
        }
        /* USER CODE BEGIN PROC_GATT_DISC_ALL_DESCS */

        /* USER CODE END PROC_GATT_DISC_ALL_DESCS */
        if (status == 0)
        {
          LOG_INFO_APP("All descriptors discovered Successfully \n\n");
        }
        else
        {
          LOG_ERROR_APP("All descriptors discovery Failed \n\n");
        }
      }
      break; /* PROC_GATT_DISC_ALL_DESCS */
      case PROC_GATT_PROPERTIES_ENABLE_ALL:
      {
        uint16_t charPropVal = 0x0000;

